app/Controllers/Admin/Buku.php

SELECT *, COUNT(judul_buku) stok
FROM `buku`
JOIN `penerbit` ON `buku`.`kode_penerbit` = `penerbit`.`kode_penerbit`
JOIN `rak` ON `buku`.`kode_rak` = `rak`.`kode_rak`
JOIN `jenis_buku` ON `buku`.`kode_jenis` = `jenis_buku`.`kode_jenis`
GROUP BY `judul_buku`
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
JOIN `buku` ON `transaksi`.`kode_buku` = `buku`.`kode_buku`
WHERE `status` = 'pinjam'
AND `judul_buku` = '5 cm'
---
    public function index()
    {
        if (session()->get('login') == null) {
            return redirect()->to(base_url('login'));
        }
        // QUERY SELECT
        $builder = $this->db->table('buku');
        $builder->select('*,COUNT(judul_buku) stok')
        ->join('penerbit','buku.kode_penerbit = penerbit.kode_penerbit')
        ->join('rak','buku.kode_rak = rak.kode_rak')
        ->join('jenis_buku', 'buku.kode_jenis = jenis_buku.kode_jenis')
        ->groupBy('judul_buku');
        $buku = $builder->get()->getResultArray();

        // $jbuku = $this->bukuModel->select('COUNT(judul_buku) jumlah')->where('status','kembali')->groupBy('judul_buku');
        $hasilbuku = [];
        foreach ($buku as $b) {
            $jbuku = $this->trans->join('buku','transaksi.kode_buku = buku.kode_buku')->where('status','pinjam')->where('judul_buku',$b['judul_buku'])->countAllResults();