app/Controllers/Admin/Dashboard.php

    public function index()
    {
        session();

        if (session()->get('login') == null) {
            return redirect()->to(base_url('login'));
        }

        $jp = $this->pModel
        ->like('waktu',date('Y-m-d'))
        ->countAllResults();

        $jpinjam = $this->trans
        ->like('status','pinjam')
        ->countAllResults();

        $jsiswa = $this->siswaModel
        ->countAllResults();

        $jbuku = $this->bukuModel
        ->countAllResults();

        $pday = $this->pModel
        ->join('siswa','siswa.nis = pengunjung.nis')
        ->join('kelas','kelas.kode_kelas = siswa.kode_kelas')
        ->like('waktu',date('Y-m-d'))
        ->findAll();

        $presen = [];
        foreach ($this->kelasModel->findAll() as $v) {
            $getpk = $this->pModel
            ->join('siswa','pengunjung.nis = siswa.nis')
            ->where('siswa.kode_kelas',$v['kode_kelas'])
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `siswa`
SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT *
FROM `kelas`
SELECT COUNT(*) AS `numrows`
FROM `pengunjung`
JOIN `siswa` ON `pengunjung`.`nis` = `siswa`.`nis`
WHERE `siswa`.`kode_kelas` = 'X Bahasa 1'

            }
            $presen[] = [
                'nama_kelas' => $v['nama_kelas'],
                'total' => $this->pModel->join('siswa','pengunjung.nis = siswa.nis')->like('siswa.kode_kelas',$v['kode_kelas'])->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `pengunjung`
JOIN `siswa` ON `pengunjung`.`nis` = `siswa`.`nis`
WHERE `siswa`.`kode_kelas` LIKE '%X Bahasa 1%' ESCAPE '!'