app/Controllers/Admin/Excel.php

                    continue;
                }

                if ($this->kelasModel->where('kode_kelas',$data[4])->countAllResults() == 0) {
---
SELECT COUNT(*) AS `numrows`
FROM `kelas`
WHERE `kode_kelas` = 'X MIPA 1'

                    continue;
                }

                if ($this->siswaModel->where('nis',$data[1])->countAllResults() > 0) {
---
SELECT COUNT(*) AS `numrows`
FROM `siswa`
WHERE `nis` = 4001