app/Controllers/Admin/Pengunjung.php

        // ->join('kelas', 'kelas.kode_kelas = siswa.kode_kelas')
        // ->findAll();

        $kelas = $this->kelasModel->findAll();
---
SELECT *
FROM `kelas`