app/Controllers/Admin/Perpustakaan.php

    public function index(): string
    {
        session();
        $perpus = $this->perpusModel->first();
---
SELECT *
FROM `perpus`
 LIMIT 1