app/Controllers/Admin/Siswa.php

SELECT *
FROM `siswa`
JOIN `kelas` ON `kelas`.`kode_kelas` = `siswa`.`kode_kelas`
---
    public function index()
    {
        session();
        // require 'vendor/autoload.php';
        // echo $generator->getBarcode('081231723897', $generator::TYPE_CODE_128);
        if (session()->get('login') == null) {
            return redirect()->to(base_url('login'));
        }

        $builder = $this->db->table('siswa');
        $siswa = $builder->join('kelas','kelas.kode_kelas = siswa.kode_kelas')->get();