app/Controllers/BaseController.php

SELECT *
FROM `sekolah`
 LIMIT 1
SELECT *
FROM `perpus`
 LIMIT 1
SELECT *
FROM `users`
JOIN `levels` ON `levels`.`id_level` = `users`.`id_level`
WHERE `id_user` = '5'
 LIMIT 1
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.

        // E.g.: $this->session = \Config\Services::session();

        //Data sekolah
        $baseSekolah = new SekolahModel();
        $basePerpus = new PerpusModel();
        $baseAku = new UsersModel();
        $this->sekolah = $baseSekolah->first();
        $this->perpus = $basePerpus->first();
        if (session()->get('login') == true) {
            $user = session()->get('user');
            $this->aku = $baseAku
            ->join('levels', 'levels.id_level = users.id_level')
            ->where('id_user',$user['id_user'])
            ->first();