app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email_user` = 'imamsafii2222022@gmail.com'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `email_user` = 'imamsafii2222022@gmail.com'
---
    function setLogin()
    {
        $setlogin = $this->request->getvar();
        $user = $this->userModel->where('email_user',$setlogin['email_user'])->first();
        if ($this->userModel->where('email_user',$setlogin['email_user'])->countAllResults() >= 1) {